app/views/payments/_index.haml

SELECT "products".* FROM "products" WHERE "products"."user_id" = ?  [["user_id", 1]]
---
		-@orders.each do |order|
			-order.products_by_user(current_user).each do |product|