app/controllers/products_controller.rb

INSERT INTO "products" ("name", "pricing", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Hola mundo"], ["pricing", 1.0], ["user_id", 1], ["created_at", "2015-10-26 05:34:41.209475"], ["updated_at", "2015-10-26 05:34:41.209475"]]
---
  def create
    @product = current_user.products.new(product_params)
    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Actualizado"], ["updated_at", "2015-10-26 06:34:39.404746"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)