app/controllers/question_controller.rb

 				if answer > 4
 					if bandera
 						bandera = false;
 						ids = AnswerXQuestion.select('questions_id').where("answers_id = ? ", answer);
						idX = '';
						ids.each do |id|
---
SELECT "answer_x_questions"."questions_id" FROM "answer_x_questions" WHERE (answers_id = 5 )
SELECT * FROM "questions" WHERE (questions.id = SELECT "answer_x_questions"."questions_id" FROM "answer_x_questions" WHERE (answers_id = 5 ) )

			bandera = false;
 		end
		@questions = Question.select('*').where("questions.id = ? ", @questions_id);
		@answers = Answer.select('*')
		.joins("LEFT JOIN question_x_answers AS qxa ON qxa.answers_id = answers.id ")
		.where("qxa.questions_id = ? ", @questions_id);


		@types = Type.all;
---
SELECT * FROM "answers" LEFT JOIN question_x_answers AS qxa ON qxa.answers_id = answers.id WHERE (qxa.questions_id = 1 )
SELECT "types".* FROM "types"